app/controllers/posts_controller.rb

  def find_post
    @post = current_admin.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."admin_id" = ? AND "posts"."id" = ? LIMIT ?  [["admin_id", 1], ["id", 0], ["LIMIT", 1]]